GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k50.inc
// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0F99h
// bitfield definitions
CM2CON0_C2CH_POSN                        equ 0000h
CM2CON0_C2CH_POSITION                    equ 0000h
CM2CON0_C2CH_SIZE                        equ 0002h
CM2CON0_C2CH_LENGTH                      equ 0002h
CM2CON0_C2CH_MASK                        equ 0003h
CM2CON0_C2R_POSN                         equ 0002h
CM2CON0_C2R_POSITION                     equ 0002h
CM2CON0_C2R_SIZE                         equ 0001h
CM2CON0_C2R_LENGTH                       equ 0001h
CM2CON0_C2R_MASK                         equ 0004h
CM2CON0_C2SP_POSN                        equ 0003h
CM2CON0_C2SP_POSITION                    equ 0003h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0008h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OE_POSN                        equ 0005h
CM2CON0_C2OE_POSITION                    equ 0005h
CM2CON0_C2OE_SIZE                        equ 0001h
CM2CON0_C2OE_LENGTH                      equ 0001h
CM2CON0_C2OE_MASK                        equ 0020h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h
CM2CON0_C2CH0_POSN                       equ 0000h
CM2CON0_C2CH0_POSITION                   equ 0000h
CM2CON0_C2CH0_SIZE                       equ 0001h
CM2CON0_C2CH0_LENGTH                     equ 0001h
CM2CON0_C2CH0_MASK                       equ 0001h
CM2CON0_C2CH1_POSN                       equ 0001h
CM2CON0_C2CH1_POSITION                   equ 0001h
CM2CON0_C2CH1_SIZE                       equ 0001h
CM2CON0_C2CH1_LENGTH                     equ 0001h
CM2CON0_C2CH1_MASK                       equ 0002h
CM2CON0_CREF_POSN                        equ 0002h
CM2CON0_CREF_POSITION                    equ 0002h
CM2CON0_CREF_SIZE                        equ 0001h
CM2CON0_CREF_LENGTH                      equ 0001h
CM2CON0_CREF_MASK                        equ 0004h
CM2CON0_CPOL_POSN                        equ 0004h
CM2CON0_CPOL_POSITION                    equ 0004h
CM2CON0_CPOL_SIZE                        equ 0001h
CM2CON0_CPOL_LENGTH                      equ 0001h
CM2CON0_CPOL_MASK                        equ 0010h
CM2CON0_COE_POSN                         equ 0005h
CM2CON0_COE_POSITION                     equ 0005h
CM2CON0_COE_SIZE                         equ 0001h
CM2CON0_COE_LENGTH                       equ 0001h
CM2CON0_COE_MASK                         equ 0020h
CM2CON0_COUT2_POSN                       equ 0006h
CM2CON0_COUT2_POSITION                   equ 0006h
CM2CON0_COUT2_SIZE                       equ 0001h
CM2CON0_COUT2_LENGTH                     equ 0001h
CM2CON0_COUT2_MASK                       equ 0040h
CM2CON0_CON_POSN                         equ 0007h
CM2CON0_CON_POSITION                     equ 0007h
CM2CON0_CON_SIZE                         equ 0001h
CM2CON0_CON_LENGTH                       equ 0001h
CM2CON0_CON_MASK                         equ 0080h
CM2CON0_CCH_POSN                         equ 0000h
CM2CON0_CCH_POSITION                     equ 0000h
CM2CON0_CCH_SIZE                         equ 0002h
CM2CON0_CCH_LENGTH                       equ 0002h
CM2CON0_CCH_MASK                         equ 0003h
CM2CON0_CCH0_POSN                        equ 0000h
CM2CON0_CCH0_POSITION                    equ 0000h
CM2CON0_CCH0_SIZE                        equ 0001h
CM2CON0_CCH0_LENGTH                      equ 0001h
CM2CON0_CCH0_MASK                        equ 0001h
CM2CON0_CCH1_POSN                        equ 0001h
CM2CON0_CCH1_POSITION                    equ 0001h
CM2CON0_CCH1_SIZE                        equ 0001h
CM2CON0_CCH1_LENGTH                      equ 0001h
CM2CON0_CCH1_MASK                        equ 0002h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0F9Ah
// bitfield definitions
CM2CON1_C2SYNC_POSN                      equ 0000h
CM2CON1_C2SYNC_POSITION                  equ 0000h
CM2CON1_C2SYNC_SIZE                      equ 0001h
CM2CON1_C2SYNC_LENGTH                    equ 0001h
CM2CON1_C2SYNC_MASK                      equ 0001h
CM2CON1_C1SYNC_POSN                      equ 0001h
CM2CON1_C1SYNC_POSITION                  equ 0001h
CM2CON1_C1SYNC_SIZE                      equ 0001h
CM2CON1_C1SYNC_LENGTH                    equ 0001h
CM2CON1_C1SYNC_MASK                      equ 0002h
CM2CON1_C2HYS_POSN                       equ 0002h
CM2CON1_C2HYS_POSITION                   equ 0002h
CM2CON1_C2HYS_SIZE                       equ 0001h
CM2CON1_C2HYS_LENGTH                     equ 0001h
CM2CON1_C2HYS_MASK                       equ 0004h
CM2CON1_C1HYS_POSN                       equ 0003h
CM2CON1_C1HYS_POSITION                   equ 0003h
CM2CON1_C1HYS_SIZE                       equ 0001h
CM2CON1_C1HYS_LENGTH                     equ 0001h
CM2CON1_C1HYS_MASK                       equ 0008h
CM2CON1_C2RSEL_POSN                      equ 0004h
CM2CON1_C2RSEL_POSITION                  equ 0004h
CM2CON1_C2RSEL_SIZE                      equ 0001h
CM2CON1_C2RSEL_LENGTH                    equ 0001h
CM2CON1_C2RSEL_MASK                      equ 0010h
CM2CON1_C1RSEL_POSN                      equ 0005h
CM2CON1_C1RSEL_POSITION                  equ 0005h
CM2CON1_C1RSEL_SIZE                      equ 0001h
CM2CON1_C1RSEL_LENGTH                    equ 0001h
CM2CON1_C1RSEL_MASK                      equ 0020h
CM2CON1_MC2OUT_POSN                      equ 0006h
CM2CON1_MC2OUT_POSITION                  equ 0006h
CM2CON1_MC2OUT_SIZE                      equ 0001h
CM2CON1_MC2OUT_LENGTH                    equ 0001h
CM2CON1_MC2OUT_MASK                      equ 0040h
CM2CON1_MC1OUT_POSN                      equ 0007h
CM2CON1_MC1OUT_POSITION                  equ 0007h
CM2CON1_MC1OUT_SIZE                      equ 0001h
CM2CON1_MC1OUT_LENGTH                    equ 0001h
CM2CON1_MC1OUT_MASK                      equ 0080h

