GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k50.inc
#define EPCONDIS6                        BANKMASK(UEP6), 3, a
#define EPCONDIS7                        BANKMASK(UEP7), 3, a
#define EPCONDIS8                        BANKMASK(UEP8), 3, a
#define EPCONDIS9                        BANKMASK(UEP9), 3, a
#define EPHSHK0                          BANKMASK(UEP0), 4, a
#define EPHSHK1                          BANKMASK(UEP1), 4, a
#define EPHSHK10                         BANKMASK(UEP10), 4, a
#define EPHSHK11                         BANKMASK(UEP11), 4, a
#define EPHSHK12                         BANKMASK(UEP12), 4, a
#define EPHSHK13                         BANKMASK(UEP13), 4, a
#define EPHSHK14                         BANKMASK(UEP14), 4, a
#define EPHSHK15                         BANKMASK(UEP15), 4, a
#define EPHSHK2                          BANKMASK(UEP2), 4, a
#define EPHSHK3                          BANKMASK(UEP3), 4, a
#define EPHSHK4                          BANKMASK(UEP4), 4, a
#define EPHSHK5                          BANKMASK(UEP5), 4, a
#define EPHSHK6                          BANKMASK(UEP6), 4, a
#define EPHSHK7                          BANKMASK(UEP7), 4, a
#define EPHSHK8                          BANKMASK(UEP8), 4, a
#define EPHSHK9                          BANKMASK(UEP9), 4, a
#define EPINEN0                          BANKMASK(UEP0), 1, a
#define EPINEN1                          BANKMASK(UEP1), 1, a
#define EPINEN10                         BANKMASK(UEP10), 1, a
#define EPINEN11                         BANKMASK(UEP11), 1, a
#define EPINEN12                         BANKMASK(UEP12), 1, a
#define EPINEN13                         BANKMASK(UEP13), 1, a
#define EPINEN14                         BANKMASK(UEP14), 1, a
#define EPINEN15                         BANKMASK(UEP15), 1, a
#define EPINEN2                          BANKMASK(UEP2), 1, a
#define EPINEN3                          BANKMASK(UEP3), 1, a
#define EPINEN4                          BANKMASK(UEP4), 1, a
#define EPINEN5                          BANKMASK(UEP5), 1, a
#define EPINEN6                          BANKMASK(UEP6), 1, a
#define EPINEN7                          BANKMASK(UEP7), 1, a
#define EPINEN8                          BANKMASK(UEP8), 1, a
#define EPINEN9                          BANKMASK(UEP9), 1, a
#define EPOUTEN0                         BANKMASK(UEP0), 2, a
#define EPOUTEN1                         BANKMASK(UEP1), 2, a
#define EPOUTEN10                        BANKMASK(UEP10), 2, a
#define EPOUTEN11                        BANKMASK(UEP11), 2, a
#define EPOUTEN12                        BANKMASK(UEP12), 2, a
#define EPOUTEN13                        BANKMASK(UEP13), 2, a
#define EPOUTEN14                        BANKMASK(UEP14), 2, a
#define EPOUTEN15                        BANKMASK(UEP15), 2, a
#define EPOUTEN2                         BANKMASK(UEP2), 2, a
#define EPOUTEN3                         BANKMASK(UEP3), 2, a
#define EPOUTEN4                         BANKMASK(UEP4), 2, a
#define EPOUTEN5                         BANKMASK(UEP5), 2, a
#define EPOUTEN6                         BANKMASK(UEP6), 2, a
#define EPOUTEN7                         BANKMASK(UEP7), 2, a
#define EPOUTEN8                         BANKMASK(UEP8), 2, a
#define EPOUTEN9                         BANKMASK(UEP9), 2, a
#define EPSTALL0                         BANKMASK(UEP0), 0, a
#define EPSTALL1                         BANKMASK(UEP1), 0, a
#define EPSTALL10                        BANKMASK(UEP10), 0, a
#define EPSTALL11                        BANKMASK(UEP11), 0, a
#define EPSTALL12                        BANKMASK(UEP12), 0, a
#define EPSTALL13                        BANKMASK(UEP13), 0, a
#define EPSTALL14                        BANKMASK(UEP14), 0, a
#define EPSTALL15                        BANKMASK(UEP15), 0, a
#define EPSTALL2                         BANKMASK(UEP2), 0, a
#define EPSTALL3                         BANKMASK(UEP3), 0, a
#define EPSTALL4                         BANKMASK(UEP4), 0, a
#define EPSTALL5                         BANKMASK(UEP5), 0, a
#define EPSTALL6                         BANKMASK(UEP6), 0, a
#define EPSTALL7                         BANKMASK(UEP7), 0, a
#define EPSTALL8                         BANKMASK(UEP8), 0, a
#define EPSTALL9                         BANKMASK(UEP9), 0, a
#define FERR                             BANKMASK(RCSTA1), 2, a
#define FLTS                             BANKMASK(OSCCON), 2, a
#define FREE                             BANKMASK(EECON1), 4, a
#define FRM0                             BANKMASK(UFRML), 0, a
#define FRM1                             BANKMASK(UFRML), 1, a
#define FRM10                            BANKMASK(UFRMH), 2, a
#define FRM2                             BANKMASK(UFRML), 2, a
#define FRM3                             BANKMASK(UFRML), 3, a
#define FRM4                             BANKMASK(UFRML), 4, a
#define FRM5                             BANKMASK(UFRML), 5, a
#define FRM6                             BANKMASK(UFRML), 6, a
#define FRM7                             BANKMASK(UFRML), 7, a
#define FRM8                             BANKMASK(UFRMH), 0, a
#define FRM9                             BANKMASK(UFRMH), 1, a
#define FSEN                             BANKMASK(UCFG), 2, a
#define FVREN                            BANKMASK(VREFCON0), 7, a
#define FVRS0                            BANKMASK(VREFCON0), 4, a
#define FVRS1                            BANKMASK(VREFCON0), 5, a
#define FVRST                            BANKMASK(VREFCON0), 6, a
#define GCEN                             BANKMASK(SSP1CON2), 7, a
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HFIOFR                           BANKMASK(OSCCON2), 1, a
#define HFIOFS                           BANKMASK(OSCCON), 2, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIN                           BANKMASK(PORTA), 5, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT                          BANKMASK(SSP1STAT), 5, a
#define I2C_READ                         BANKMASK(SSP1STAT), 2, a
#define I2C_START                        BANKMASK(SSP1STAT), 3, a
#define I2C_STOP                         BANKMASK(SSP1STAT), 4, a
#define IDISSEN                          BANKMASK(CTMUCONH), 1, a
#define IDLEIE                           BANKMASK(UIE), 4, a
#define IDLEIF                           BANKMASK(UIR), 4, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTB), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTSRC                           BANKMASK(OSCCON2), 5, a
#define IOCB4                            BANKMASK(IOCB), 4, a
#define IOCB5                            BANKMASK(IOCB), 5, a
#define IOCB6                            BANKMASK(IOCB), 6, a
#define IOCB7                            BANKMASK(IOCB), 7, a
#define IOCC0                            BANKMASK(IOCC), 0, a
#define IOCC1                            BANKMASK(IOCC), 1, a
#define IOCC2                            BANKMASK(IOCC), 2, a
#define IOCC4                            BANKMASK(IOCC), 4, a
#define IOCC5                            BANKMASK(IOCC), 5, a
#define IOCC6                            BANKMASK(IOCC), 6, a
#define IOCC7                            BANKMASK(IOCC), 7, a
#define IOCIE                            BANKMASK(INTCON), 3, a
#define IOCIF                            BANKMASK(INTCON), 0, a
#define IOCIP                            BANKMASK(INTCON2), 0, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRNG0                            BANKMASK(CTMUICON), 0, a
#define IRNG1                            BANKMASK(CTMUICON), 1, a
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define ITRIM0                           BANKMASK(CTMUICON), 2, a
#define ITRIM1                           BANKMASK(CTMUICON), 3, a
#define ITRIM2                           BANKMASK(CTMUICON), 4, a
#define ITRIM3                           BANKMASK(CTMUICON), 5, a
#define ITRIM4                           BANKMASK(CTMUICON), 6, a
#define ITRIM5                           BANKMASK(CTMUICON), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LFIOFS                           BANKMASK(OSCCON2), 0, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define MC1OUT                           BANKMASK(CM2CON1), 7, a
#define MC2OUT                           BANKMASK(CM2CON1), 6, a
#define MSK0                             BANKMASK(SSP1ADD), 0, a
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK1                             BANKMASK(SSP1ADD), 1, a
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK2                             BANKMASK(SSP1ADD), 2, a
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK3                             BANKMASK(SSP1ADD), 3, a
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK4                             BANKMASK(SSP1ADD), 4, a
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK5                             BANKMASK(SSP1ADD), 5, a
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK6                             BANKMASK(SSP1ADD), 6, a
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK7                             BANKMASK(SSP1ADD), 7, a
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSSP1MD                          BANKMASK(PMD1), 6, a
#define MSSPMD                           BANKMASK(PMD1), 6, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSP1STAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_W                            BANKMASK(SSP1STAT), 2, a
#define NOT_WRITE                        BANKMASK(SSP1STAT), 2, a
#define NVCFG0                           BANKMASK(ADCON1), 0, a
#define NVCFG1                           BANKMASK(ADCON1), 1, a
#define OERR                             BANKMASK(RCSTA1), 1, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1A                              BANKMASK(PORTC), 2, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(PWM1CON), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCIE                             BANKMASK(SSP1CON3), 6, a
#define PD                               BANKMASK(RCON), 2, a
#define PDC0                             BANKMASK(PWM1CON), 0, a
#define PDC1                             BANKMASK(PWM1CON), 1, a
#define PDC2                             BANKMASK(PWM1CON), 2, a
#define PDC3                             BANKMASK(PWM1CON), 3, a
#define PDC4                             BANKMASK(PWM1CON), 4, a
#define PDC5                             BANKMASK(PWM1CON), 5, a
#define PDC6                             BANKMASK(PWM1CON), 6, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSP1CON2), 2, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PGM                              BANKMASK(PORTB), 5, a
#define PIDEE                            BANKMASK(UEIE), 0, a
#define PIDEF                            BANKMASK(UEIR), 0, a
#define PKTDIS                           BANKMASK(UCON), 4, a
#define PLLEN                            BANKMASK(OSCCON2), 4, a
#define PLLRDY                           BANKMASK(OSCCON2), 7, a
#define POR                              BANKMASK(RCON), 1, a
#define PPB0                             BANKMASK(UCFG), 0, a
#define PPB1                             BANKMASK(UCFG), 1, a
#define PPBI                             BANKMASK(USTAT), 1, a
#define PPBRST                           BANKMASK(UCON), 6, a
#define PR1SEN                           BANKMASK(PWM1CON), 7, a
#define PRISD                            BANKMASK(OSCCON2), 2, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSSAC0                           BANKMASK(ECCP1AS), 2, a
#define PSSAC1                           BANKMASK(ECCP1AS), 3, a
#define PSSBD0                           BANKMASK(ECCP1AS), 0, a
#define PSSBD1                           BANKMASK(ECCP1AS), 1, a
#define PVCFG0                           BANKMASK(ADCON1), 2, a
#define PVCFG1                           BANKMASK(ADCON1), 3, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCEN                             BANKMASK(SSP1CON2), 3, a
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCIDL                            BANKMASK(BAUDCON1), 6, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT                             BANKMASK(BAUDCON1), 6, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD161                            BANKMASK(T1CON), 7, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RE3                              BANKMASK(PORTE), 3, a
#define READ_WRITE                       BANKMASK(SSP1STAT), 2, a
#define RESUME                           BANKMASK(UCON), 2, a
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RSEN                             BANKMASK(SSP1CON2), 1, a
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RW                               BANKMASK(SSP1STAT), 2, a
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RX                               BANKMASK(PORTC), 7, a
#define RX9                              BANKMASK(RCSTA1), 6, a
#define RX9D                             BANKMASK(RCSTA1), 0, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXCKP                            BANKMASK(BAUDCON1), 5, a
#define RXDTP                            BANKMASK(BAUDCON1), 5, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define R_NOT_W                          BANKMASK(SSP1STAT), 2, a
#define R_W                              BANKMASK(SSP1STAT), 2, a
#define R_nW                             BANKMASK(SSP1STAT), 2, a
#define SBCDE                            BANKMASK(SSP1CON3), 2, a
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCIE                             BANKMASK(SSP1CON3), 5, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDAHT                            BANKMASK(SSP1CON3), 3, a
#define SE0                              BANKMASK(UCON), 5, a
#define SEN                              BANKMASK(SSP1CON2), 0, a
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SIDL                             BANKMASK(CTMUCONH), 5, a
#define SLRA                             BANKMASK(SLRCON), 0, a
#define SLRB                             BANKMASK(SLRCON), 1, a
#define SLRC                             BANKMASK(SLRCON), 2, a
#define SMP                              BANKMASK(SSP1STAT), 7, a
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SOFIE                            BANKMASK(UIE), 6, a
